#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_iam_role.lambda_cust_role: Refreshing state... [id=lambda_cust_role]
aws_dynamodb_table.visitors_app_table: Refreshing state... [id=Visitors]
aws_api_gateway_rest_api.visitors_rest_api: Refreshing state... [id=wvmekkxrt8]
aws_lambda_layer_version.visitors_app_layer: Refreshing state... [id=arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:16]
aws_iam_role_policy.lambda_cust_policy: Refreshing state... [id=lambda_cust_role:lambda_cust_policy]
aws_api_gateway_resource.visitors_app_proxy: Refreshing state... [id=73931p]
aws_lambda_function.visitorsapp: Refreshing state... [id=visitorsapp]
aws_api_gateway_method.visitors_gateway_proxy: Refreshing state... [id=agm-wvmekkxrt8-73931p-ANY]
aws_lambda_permission.visitors_apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.visitors_app_lambda: Refreshing state... [id=agi-wvmekkxrt8-73931p-ANY]
aws_api_gateway_deployment.visitors_app_api_gateway_deploy: Refreshing state... [id=cmfjnt]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.visitorsapp will be updated in-place
  ~ resource "aws_lambda_function" "visitorsapp" {
        id                             = "visitorsapp"
      ~ last_modified                  = "2021-03-05T02:34:24.177+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "yhqgD0NJB7LbxevDr/ED/FR1+QGaCRGQBRWFELy1WsQ=" -> "pkz7xMs34P/v+M5KvuVmOdm2FXcFq7NcK1R/3FsbjbA="
        tags                           = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.visitors_app_layer must be replaced
-/+ resource "aws_lambda_layer_version" "visitors_app_layer" {
      ~ arn                 = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:16" -> (known after apply)
      ~ created_date        = "2021-03-05T02:34:15.162+0000" -> (known after apply)
      ~ id                  = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:16" -> (known after apply)
      ~ layer_arn           = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer" -> (known after apply)
      ~ source_code_hash    = "UAUwlD5vEFhMqeh91C5jPovP13qmCoAnR5b9HQp0ebQ=" -> "+KpRQdhQ5QRN2KGKof4cEj9VgtWfQIsoK7JQcqxOx+8=" # forces replacement
      ~ source_code_size    = 10216818 -> (known after apply)
      ~ version             = "16" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @lebergarrett, Action: `pull_request`*